<?php  if ( ! defined('BASEPATH')) exit('No direct script access allowed');

/**
 * --------------------------------------------------------------------------
 * 轉換指令
 * --------------------------------------------------------------------------
 * 
 * 在此設定要轉換的bash腳本
 * 
 * 輸入檔案名稱為：[INPUT_FILE]
 * 輸出檔案名稱為：[OUTPUT_FILE]
 * 
 * 例1：copy [INPUT_FILE] [OUTPUT_FILE]
 */
$convertor['script']	= 'copy [INPUT_FILE] [OUTPUT_FILE]';

/**
 * --------------------------------------------------------------------------
 * 轉換檔案的位置
 * --------------------------------------------------------------------------
 */
$convertor['convert-files']['converting']	= 'convert-files/converting';

/**
 * --------------------------------------------------------------------------
 * 轉換完成檔案的位置
 * --------------------------------------------------------------------------
 */
$convertor['convert-files']['completed']	= 'convert-files/completed';

/**
 * --------------------------------------------------------------------------
 * 保留檔案上限
 * --------------------------------------------------------------------------
 * 
 * 當上傳檔案超過這個數字時，更舊的檔案就會刪除
 */
$convertor['max-reserved-files']	= '3';


/* End of file convertor.php */
/* Location: ./application/config/convertor.php */
